//============================================================================
// Name        : CReport.cpp
// Author      : S.Rasmussen
// Date        : 5/01/2009
// Copyright   : Copyright NIWA Science �2008 - www.niwa.co.nz
// Description :
// $Date: 2008-03-04 16:33:32 +1300 (Tue, 04 Mar 2008) $
//============================================================================

// Local headers
#include "CReport.h"

//**********************************************************************
// CReport::CReport()
// Default Constructor
//**********************************************************************
CReport::CReport() {
  // Default
  eExecutionState = STATE_INVALID;
}

//**********************************************************************
// CReport::~CReport()
// Destructor
//**********************************************************************
CReport::~CReport() {}
